package JavaImmutableClass;

public class Details
{

}
/*Immutable Class:-(Jis class ke Object ko change na kiya ja sake ):
  -> Immutable Class बनाने के कुल 5 नियम (Rules):
  1.Class को final बनाएं:
     -ताकि कोई दूसरी क्लास उसे Inherit (Extend) न कर सके
     और उसके तरीकों को Overwrite करके उसकी immutability को तोड़ न सके।

  2.Fields को private और final बनाएं:
    -private ताकि बाहर से कोई सीधे डेटा न बदल सके,
    और final ताकि उन वेरिएबल्स की वैल्यू सिर्फ एक ही बार (ऑब्जेक्ट बनते वक्त) सेट की जा सके,
     दोबारा नहीं।

  3.सिर्फ Constructor के जरिए वैल्यू सेट करें:
  -ऑब्जेक्ट बनाते वक्त कंस्ट्रक्टर के माध्यम से सभी फील्ड्स में इनिशियल वैल्यू पास कर दी जाए।

  4.सिर्फ Getter मेथड्स दें, Setter बिल्कुल न दें:
   -ताकि कोई बाहर से डेटा पढ़ तो सके, लेकिन उसे मॉडिफाई (चेंज) न कर सके।

   5.⭐ (पाँचवा और सबसे खास नियम) - Deep Copy (Defensive Copying) का इस्तेमाल करना:
     -यह नियम क्या कहता है? अगर आपकी Immutable क्लास के अंदर कोई ऐसी फील्ड है जो खुद
      एक Mutable ऑब्जेक्ट है (जैसे java.util.Date या List), तो कंस्ट्रक्टर में वैल्यू लेते वक्त
      और गेटर से वैल्यू रिटर्न करते वक्त उसकी कौपी (Copy) पास करनी चाहिए, न कि उसका ओरिजिनल रेفرنس।
      -क्यों? अगर आप ओरिजिनल रेفرنس पास कर देंगे, तो बाहर से कोई भी उस लिस्ट या डेट को बदल
      देगा और आपकी क्लास अंदर से बदल जाएगी (यानी वह Immutable नहीं रह जाएगी)।

*/