package Java8Features.DateAndTimeAPI;

public class DetailsOfDateAndTimeAPI
{
}
/*Java 8 Date & Time API -:

 -वा 8 से पहले Date और Time को संभालना किसी बुरे सपने जैसा था।
 java.util.Date और java.util.Calendar क्लासेज बहुत ज्यादा उलझन भरी थीं,
  वे Thread-Safe नहीं थीं (यानी मल्टी-थ्रेडिंग में डेटा गड़बड़ हो जाता था),
  और उनके मंथ्स (Months) 0 से शुरू होते थे (यानी जनवरी मतलब 0!).

  -इन सारी समस्याओं को दूर करने के लिए जावा 8 में एक बिल्कुल नया और शानदार java.time
   (Date and Time API) पैकेज लाया गया, जो Joda-Time लाइब्रेरी से प्रेरित है।

-1->. नई API की मुख्य खासियतें (Why was it introduced?)
    -Thread-Safe: इसकी सभी मुख्य क्लासेज Immutable (अपरिवर्तनीय) हैं,
    यानी एक बार ऑब्जेक्ट बन गया तो कोई दूसरा थ्रेड उसकी वैल्यू बदल नहीं सकता।
   -साफ और आसान डिजाइन: इसमें तारीख (Date), समय (Time),
   और टाइमज़ोन (Timezone) के लिए बिल्कुल अलग-अलग और स्पष्ट क्लासेज हैं।

 -2->. java.time पैकेज की सबसे महत्वपूर्ण क्लासेज:
      -आइए इसकी 4 सबसे जरूरी और काम आने वाली क्लासेज को देखते हैं:

      क. LocalDate (केवल तारीख के लिए - Year-Month-Day):-
               इसमें समय (Hours/Minutes) नहीं होता, सिर्फ साल, महीना और तारीख होती है।
               उदाहरण: जन्मदिन, सालगिरह या एनिवर्सरी की तारीख सेव करने के लिए।

     ख. LocalTime (केवल समय के लिए - Hour-Minute-Second-Nano)
                इसमें तारीख नहीं होती, केवल घड़ी का समय होता है।
                उदाहरण: ऑफिस खुलने का समय या अलार्म का टाइम।

   ग. LocalDateTime (तारीख और समय दोनों के लिए)
              यह LocalDate और LocalTime दोनों का कॉम्बिनेशन है (बिना किसी टाइमज़ोन के)।
              उदाहरण: किसी लॉग फाइल में एंट्री का समय या आर्डर प्लेस करने का टाइम।

  घ. ZonedDateTime (तारीख, समय और दुनिया का कोई भी टाइमज़ोन)
            अगर आपको किसी खास देश या शहर के टाइमज़ोन के हिसाब से समय देखना हो
            (जैसे न्यूयॉर्क या टोक्यो का समय), तब इसका उपयोग होता है
 --------------------------------------------------------------------------------------
  4. दो तारीखों के बीच अंतर निकालना (Period और Duration):-
     -जब आपको यह कैलकुलेट करना हो कि दो तारीखों के बीच कितने दिन,
      महीने या साल का अंतर है, तब जावा 8 आपको दो खास Classes देता है:

     1.Period: इसका उपयोग तारीखों (Dates) के बीच का अंतर निकालने के लिए होता है (साल, महीने, दिन)।
     2.Duration: इसका उपयोग समय (Time) के बीच का अंतर निकालने के लिए होता है (घंटे, मिनट, सेकंड)।

=>इंटरव्यू का एक जरूरी सवाल:
    -Q. पुरानी java.util.Date क्लास और जावा 8 की नई LocalDate क्लास में सबसे बड़ा अंतर क्या है?
     -उत्तर: पुरानी Date क्लास Mutable (परिवर्तनीय) थी (यानी उसकी वैल्यू बदली जा सकती थी जिससे थ्रेड-सेफ्टी की समस्या होती थी),
      जबकि जावा 8 की नई डेट क्लासेज Immutable और Thread-Safe हैं। साथ ही पुरानी क्लास में टाइमज़ोन को संभालना बहुत कठिन था जो नए में बेहद आसान हो गया है।

 */